Sambulov/COS/MCU/ARM/GD32E23X/Port/Inc/port_core.h

#ifndef PORT_CORE_H_
#define PORT_CORE_H_

#if defined ( GD32E23X ) || defined ( GD32F103VG )

#define HDL_INTERRUPT_PRV_SIZE       9

typedef enum {
#if defined ( GD32E23X )
    /* Cortex-M23 processor exceptions numbers */
  HDL_NVIC_EXCEPTION_NMI               = NonMaskableInt_IRQn,        /*!< non maskable interrupt                                   */
  HDL_NVIC_EXCEPTION_HF                = HardFault_IRQn,             /*!< hardfault interrupt                                      */
  HDL_NVIC_EXCEPTION_SVC               = SVCall_IRQn,                /*!< sv call interrupt                                        */
  HDL_NVIC_EXCEPTION_PSV               = PendSV_IRQn,                /*!< pend sv interrupt                                        */
  HDL_NVIC_EXCEPTION_SisTick           = SysTick_IRQn,               /*!< system tick interrupt                                    */
  /* interruput numbers */
  HDL_NVIC_IRQ0_WWDGT                  = WWDGT_IRQn,                 /*!< window watchdog timer interrupt                          */
  HDL_NVIC_IRQ1_LVD                    = LVD_IRQn,                   /*!< LVD through EXTI line detect interrupt                   */
  HDL_NVIC_IRQ2_RTC                    = RTC_IRQn,                   /*!< RTC through EXTI line interrupt                          */
  HDL_NVIC_IRQ3_FMC                    = FMC_IRQn,                   /*!< FMC interrupt                                            */
  HDL_NVIC_IRQ4_RCU                    = RCU_IRQn,                   /*!< RCU interrupt                                            */
  HDL_NVIC_IRQ5_EXTI0_1                = EXTI0_1_IRQn,               /*!< EXTI line 0 and 1 interrupts                             */
  HDL_NVIC_IRQ6_EXTI2_3                = EXTI2_3_IRQn,               /*!< EXTI line 2 and 3 interrupts                             */
  HDL_NVIC_IRQ7_EXTI4_15               = EXTI4_15_IRQn,              /*!< EXTI line 4 to 15 interrupts                             */
  HDL_NVIC_IRQ8                        = 8,
  HDL_NVIC_IRQ9_DMA_CH0                = DMA_Channel0_IRQn,          /*!< DMA channel 0 interrupt                                  */
  HDL_NVIC_IRQ10_DMA_CH1_2             = DMA_Channel1_2_IRQn,        /*!< DMA channel 1 and channel 2 interrupts                   */
  HDL_NVIC_IRQ11_DMA_CH3_4             = DMA_Channel3_4_IRQn,        /*!< DMA channel 3 and channel 4 interrupts                   */
  HDL_NVIC_IRQ12_ADC_CMP               = ADC_CMP_IRQn,               /*!< ADC, CMP interrupts                                      */
  HDL_NVIC_IRQ13_TIMER0_BRK_UP_TRG_COM = TIMER0_BRK_UP_TRG_COM_IRQn, /*!< TIMER0 break, update, trigger and commutation interrupts */
  HDL_NVIC_IRQ14_TIMER0_CH             = TIMER0_Channel_IRQn,        /*!< TIMER0 channel capture compare interrupts                */
  HDL_NVIC_IRQ15                       = 15,
  HDL_NVIC_IRQ16_TIMER2                = TIMER2_IRQn,                /*!< TIMER2 interrupt                                         */
  HDL_NVIC_IRQ17_TIMER5                = TIMER5_IRQn,                /*!< TIMER5 interrupt                                         */
  HDL_NVIC_IRQ18                       = 18,
  HDL_NVIC_IRQ19_TIMER13               = TIMER13_IRQn,               /*!< TIMER13 interrupt                                        */
  HDL_NVIC_IRQ20_TIMER14               = TIMER14_IRQn,               /*!< TIMER14 interrupt                                        */
  HDL_NVIC_IRQ21_TIMER15               = TIMER15_IRQn,               /*!< TIMER15 interrupt                                        */
  HDL_NVIC_IRQ22_TIMER16               = TIMER16_IRQn,               /*!< TIMER16 interrupt                                        */
  HDL_NVIC_IRQ23_I2C0_EV               = I2C0_EV_IRQn,               /*!< I2C0 event interrupt                                     */
  HDL_NVIC_IRQ24_I2C1_EV               = I2C1_EV_IRQn,               /*!< I2C1 event interrupt                                     */
  HDL_NVIC_IRQ25_SPI0                  = SPI0_IRQn,                  /*!< SPI0 interrupt                                           */
  HDL_NVIC_IRQ26_SPI1                  = SPI1_IRQn,                  /*!< SPI1 interrupt                                           */
  HDL_NVIC_IRQ27_USART0                = USART0_IRQn,                /*!< USART0 interrupt                                         */
  HDL_NVIC_IRQ28_USART1                = USART1_IRQn,                /*!< USART1 interrupt                                         */
  HDL_NVIC_IRQ29                       = 29,
  HDL_NVIC_IRQ30                       = 30,
  HDL_NVIC_IRQ31                       = 31,
  HDL_NVIC_IRQ32_I2C0_ER               = I2C0_ER_IRQn,               /*!< I2C0 error interrupt                                     */
  HDL_NVIC_IRQ33                       = 33,
  HDL_NVIC_IRQ34_I2C1_ER               = I2C1_ER_IRQn,               /*!< I2C1 error interrupt                                     */
  HDL_NVIC_IRQ35                       = 35,
  HDL_NVIC_IRQ36                       = 36,
  HDL_NVIC_IRQ37                       = 37,
  HDL_NVIC_IRQ38                       = 38,
  HDL_NVIC_IRQ39                       = 39,
  HDL_NVIC_IRQ40                       = 40,
  HDL_NVIC_IRQ41                       = 41,
  HDL_NVIC_IRQ42                       = 42,
  HDL_NVIC_IRQ43                       = 43,
  HDL_NVIC_IRQ44                       = 44,
  HDL_NVIC_IRQ45                       = 45,
  HDL_NVIC_IRQ46                       = 46,
  HDL_NVIC_IRQ47                       = 47,
  HDL_NVIC_IRQ48                       = 48,
#endif
#if defined ( GD32F103VG )
  /* Cortex-M3 processor exceptions numbers */
  HDL_NVIC_EXCEPTION_NonMaskableInt          = -14,    /*!< 2 non maskable interrupt                                 */
  HDL_NVIC_EXCEPTION_HardFault               = -13,    /*!< hardfault interrupt                                      */
  HDL_NVIC_EXCEPTION_MemoryManagement        = -12,    /*!< 4 Cortex-M3 memory management interrupt                  */
  HDL_NVIC_EXCEPTION_BusFault                = -11,    /*!< 5 Cortex-M3 bus fault interrupt                          */
  HDL_NVIC_EXCEPTION_UsageFault              = -10,    /*!< 6 Cortex-M3 usage fault interrupt                        */
  HDL_NVIC_EXCEPTION_SVCall                  = -5,     /*!< 11 Cortex-M3 SV call interrupt                           */
  HDL_NVIC_EXCEPTION_DebugMonitor            = -4,     /*!< 12 Cortex-M3 debug monitor interrupt                     */
  HDL_NVIC_EXCEPTION_PendSV                  = -2,     /*!< 14 Cortex-M3 pend SV interrupt                           */
  HDL_NVIC_EXCEPTION_SysTick                 = -1,     /*!< 15 Cortex-M3 system tick interrupt                       */

  /* interruput numbers */
  HDL_NVIC_IRQ0_WWDGT                        = 0,      /*!< window watchDog timer interrupt                          */
  HDL_NVIC_IRQ1_LVD                          = 1,      /*!< LVD through EXTI line detect interrupt                   */
  HDL_NVIC_IRQ2_TAMPER                       = 2,      /*!< tamper through EXTI line detect                          */
  HDL_NVIC_IRQ3_RTC                          = 3,      /*!< RTC through EXTI line interrupt                          */
  HDL_NVIC_IRQ4_FMC                          = 4,      /*!< FMC interrupt                                            */
  HDL_NVIC_IRQ5_RCU_CTC                      = 5,      /*!< RCU and CTC interrupt                                    */
  HDL_NVIC_IRQ6_EXTI0                        = 6,      /*!< EXTI line 0 interrupts                                   */
  HDL_NVIC_IRQ7_EXTI1                        = 7,      /*!< EXTI line 1 interrupts                                   */
  HDL_NVIC_IRQ8_EXTI2                        = 8,      /*!< EXTI line 2 interrupts                                   */
  HDL_NVIC_IRQ9_EXTI3                        = 9,      /*!< EXTI line 3 interrupts                                   */
  HDL_NVIC_IRQ10_EXTI4                       = 10,     /*!< EXTI line 4 interrupts                                   */
  HDL_NVIC_IRQ11_DMA0_Channel0               = 11,     /*!< DMA0 channel0 interrupt                                  */
  HDL_NVIC_IRQ12_DMA0_Channel1               = 12,     /*!< DMA0 channel1 interrupt                                  */
  HDL_NVIC_IRQ13_DMA0_Channel2               = 13,     /*!< DMA0 channel2 interrupt                                  */
  HDL_NVIC_IRQ14_DMA0_Channel3               = 14,     /*!< DMA0 channel3 interrupt                                  */
  HDL_NVIC_IRQ15_DMA0_Channel4               = 15,     /*!< DMA0 channel4 interrupt                                  */
  HDL_NVIC_IRQ16_DMA0_Channel5               = 16,     /*!< DMA0 channel5 interrupt                                  */
  HDL_NVIC_IRQ17_DMA0_Channel6               = 17,     /*!< DMA0 channel6 interrupt                                  */
  HDL_NVIC_IRQ18_ADC0_1                      = 18,     /*!< ADC0 and ADC1 interrupt                                  */

#ifdef GD32F10X_MD
  HDL_NVIC_IRQ19_USBD_HP_CAN0_TX             = 19,     /*!< CAN0 TX interrupts                                       */
  HDL_NVIC_IRQ20_USBD_LP_CAN0_RX0            = 20,     /*!< CAN0 RX0 interrupts                                      */
  HDL_NVIC_IRQ21_CAN0_RX1                    = 21,     /*!< CAN0 RX1 interrupts                                      */
  HDL_NVIC_IRQ22_CAN0_EWMC                   = 22,     /*!< CAN0 EWMC interrupts                                     */
  HDL_NVIC_IRQ23_EXTI5_9                     = 23,     /*!< EXTI[9:5] interrupts                                     */
  HDL_NVIC_IRQ24_TIMER0_BRK                  = 24,     /*!< TIMER0 break interrupts                                  */
  HDL_NVIC_IRQ25_TIMER0_UP                   = 25,     /*!< TIMER0 update interrupts                                 */
  HDL_NVIC_IRQ26_TIMER0_TRG_CMT              = 26,     /*!< TIMER0 trigger and commutation interrupts                */
  HDL_NVIC_IRQ27_TIMER0_Channel              = 27,     /*!< TIMER0 channel capture compare interrupts                */
  HDL_NVIC_IRQ28_TIMER1                      = 28,     /*!< TIMER1 interrupt                                         */
  HDL_NVIC_IRQ29_TIMER2                      = 29,     /*!< TIMER2 interrupt                                         */
  HDL_NVIC_IRQ30_TIMER3                      = 30,     /*!< TIMER3 interrupts                                        */
  HDL_NVIC_IRQ31_I2C0_EV                     = 31,     /*!< I2C0 event interrupt                                     */
  HDL_NVIC_IRQ32_I2C0_ER                     = 32,     /*!< I2C0 error interrupt                                     */
  HDL_NVIC_IRQ33_I2C1_EV                     = 33,     /*!< I2C1 event interrupt                                     */
  HDL_NVIC_IRQ34_I2C1_ER                     = 34,     /*!< I2C1 error interrupt                                     */
  HDL_NVIC_IRQ35_SPI0                        = 35,     /*!< SPI0 interrupt                                           */
  HDL_NVIC_IRQ36_SPI1                        = 36,     /*!< SPI1 interrupt                                           */
  HDL_NVIC_IRQ37_USART0                      = 37,     /*!< USART0 interrupt                                         */
  HDL_NVIC_IRQ38_USART1                      = 38,     /*!< USART1 interrupt                                         */
  HDL_NVIC_IRQ39_USART2                      = 39,     /*!< USART2 interrupt                                         */
  HDL_NVIC_IRQ40_EXTI10_15                   = 40,     /*!< EXTI[15:10] interrupts                                   */
  HDL_NVIC_IRQ41_RTC_Alarm                   = 41,     /*!< RTC alarm interrupt                                      */
  HDL_NVIC_IRQ42_USBD_WKUP                   = 42,     /*!< USBD Wakeup interrupt                                    */
  HDL_NVIC_IRQ43                             = 43,
  HDL_NVIC_IRQ44                             = 44,
  HDL_NVIC_IRQ45                             = 45,
  HDL_NVIC_IRQ46                             = 46,
  HDL_NVIC_IRQ47                             = 47,
  HDL_NVIC_IRQ48_EXMC                        = 48,     /*!< EXMC global interrupt                                    */
  HDL_NVIC_IRQ49                             = 49,
  HDL_NVIC_IRQ50                             = 50,
  HDL_NVIC_IRQ51                             = 51,
  HDL_NVIC_IRQ52                             = 52,
  HDL_NVIC_IRQ53                             = 53,
  HDL_NVIC_IRQ54                             = 54,
  HDL_NVIC_IRQ55                             = 55,
  HDL_NVIC_IRQ56                             = 56,
  HDL_NVIC_IRQ57                             = 57,
  HDL_NVIC_IRQ58                             = 58,
  HDL_NVIC_IRQ59                             = 59,
  HDL_NVIC_IRQ60                             = 60,
  HDL_NVIC_IRQ61                             = 61,
  HDL_NVIC_IRQ62                             = 62,
  HDL_NVIC_IRQ63                             = 63,
  HDL_NVIC_IRQ64                             = 64,
  HDL_NVIC_IRQ65                             = 65,
  HDL_NVIC_IRQ66                             = 66,
  HDL_NVIC_IRQ67                             = 67,
#endif /* GD32F10X_MD */

